; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v7 - type_3 ?v2 - type_1)
 	      (pred_4 ?v1 - object ?v2 - type_1)
	      (pred_1 ?v7 - type_3 ?v5 - type_2)
	      (pred_3 ?v7 - type_3 ?v1 - object ?v5 - type_2))

   (:action op_3
       :parameters  (?v7 - type_3 ?v4 ?v3 - type_1)
       :precondition (and  (pred_2 ?v7 ?v4))
       :effect (and  (pred_2 ?v7 ?v3)
		     (not (pred_2 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_3 ?v8 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v6) (pred_2 ?v7 ?v6) (pred_1 ?v7 ?v5))
       :effect (and (pred_3 ?v7 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v6)) 
		    (not (pred_1 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_3 ?v8 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v8 ?v5) (pred_2 ?v7 ?v6))
       :effect (and (pred_4 ?v8 ?v6)
		    (pred_1 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v8 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_04 obj_03 - type_3
obj_01 obj_12 obj_05 obj_11 - type_2
obj_07 obj_08 obj_02 - type_1
obj_09 obj_10 obj_06 - object)
(:init
(pred_2 obj_04 obj_07)
(pred_1 obj_04 obj_01)
(pred_1 obj_04 obj_12)
(pred_2 obj_03 obj_02)
(pred_1 obj_03 obj_05)
(pred_1 obj_03 obj_11)
(pred_4 obj_09 obj_02)
(pred_4 obj_10 obj_02)
(pred_4 obj_06 obj_07)
)
(:goal
(and
(pred_4 obj_09 obj_08)
(pred_4 obj_10 obj_07)
(pred_4 obj_06 obj_02)
)
)

(:constraints
  (always (not (pred_2 obj_04 obj_02)))
)
)

; plan
1. (op_3 obj_04 obj_07 obj_08)
   deleted: (pred_2 obj_04 obj_07)
   added: (pred_2 obj_04 obj_08)
   goals met: 0 of 3
2. (op_1 obj_03 obj_10 obj_02 obj_11)
   deleted: (pred_4 obj_10 obj_02) (pred_1 obj_03 obj_11)
   added: (pred_3 obj_03 obj_10 obj_11)
   goals met: 0 of 3
3. (op_3 obj_03 obj_02 obj_07)
   deleted: (pred_2 obj_03 obj_02)
   added: (pred_2 obj_03 obj_07)
   goals met: 0 of 3
4. (op_2 obj_03 obj_10 obj_07 obj_11)
   deleted: (pred_3 obj_03 obj_10 obj_11)
   added: (pred_4 obj_10 obj_07) (pred_1 obj_03 obj_11)
   goals met: 1 of 3
5. (op_1 obj_03 obj_06 obj_07 obj_05)
   deleted: (pred_4 obj_06 obj_07) (pred_1 obj_03 obj_05)
   added: (pred_3 obj_03 obj_06 obj_05)
   goals met: 1 of 3
6. (op_3 obj_03 obj_07 obj_02)
   deleted: (pred_2 obj_03 obj_07)
   added: (pred_2 obj_03 obj_02)
   goals met: 1 of 3
7. (op_2 obj_03 obj_06 obj_02 obj_05)
   deleted: (pred_3 obj_03 obj_06 obj_05)
   added: (pred_4 obj_06 obj_02) (pred_1 obj_03 obj_05)
   goals met: 2 of 3
8. (op_1 obj_03 obj_09 obj_02 obj_11)
   deleted: (pred_4 obj_09 obj_02) (pred_1 obj_03 obj_11)
   added: (pred_3 obj_03 obj_09 obj_11)
   goals met: 2 of 3
9. (op_3 obj_03 obj_02 obj_08)
   deleted: (pred_2 obj_03 obj_02)
   added: (pred_2 obj_03 obj_08)
   goals met: 2 of 3
10. (op_2 obj_03 obj_09 obj_08 obj_11)
   deleted: (pred_3 obj_03 obj_09 obj_11)
   added: (pred_4 obj_09 obj_08) (pred_1 obj_03 obj_11)
   goals met: 3 of 3
